prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_CIS_2007-05_ricercaClinicaGenerica.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
<TestInfo>
	<Autore>Manfredi Salvatore</Autore>
  	<DataPreparazione>22/05/2007</DataPreparazione>
  	<CodiceContesto>C06</CodiceContesto>
  	<TipoTest>F</TipoTest>
  	<Priorita>H</Priorita>
  	<DescrizioneCaso>
		-Emergenza attiva ricercaClinicaGenericaEventiEmergenzaTutti
		-Con entranbi gli identificatori Cittadino TSTTNT94T41G388F - 999AW989
		-Estra anche i farmaceutici
		-datamax impostata
		-maxRecords 10
		-pageNumber 2
  	</DescrizioneCaso>
  	<DescrizioneRisultatoAtteso>
		Condizioni di ricerca soddisfatte
		+WA0013
  	</DescrizioneRisultatoAtteso>
</TestInfo>
-->
<soap-env:Envelope 
	xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
	xmlns:xsd="http://www.w3.org/1999/XMLSchema" 
	xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
	soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
			<Security>
				<FunContext>
					<credential>
						<validity>
							<emittedDate>10/08/2005+16:44:40,796</emittedDate>
							<sessionMaxTime>10/08/2005+16:44:40,796</sessionMaxTime>
						</validity>
						<vrs>
							<mjr>1</mjr>
							<min>0</min>
						</vrs>
						<ctf>
							<reg>
								<cod/>
								<des/>
							</reg>
							<app>
								<cod/>
								<des/>
							</app>
							<pro>
								<cod/>
								<des/>
							</pro>
							<ter>
								<cod/>
								<des/>
							</ter>
							<str>
								<cod>030968</cod>
								<des/>
							</str>
							<pre>
								<cod/>
								<des/>
							</pre>
							<rep>
								<cod/>
								<des/>
							</rep>
						</ctf>
						<role>
							<code>5</code>
							<description>Direttore medico</description>
						</role>
						<userId>MEDUNO01R01F351X</userId>
						<iupSeed>12345</iupSeed>
					</credential>
				</FunContext>
				<CitCardPresent>true</CitCardPresent>
				<CitAuth>true</CitAuth>
				<CitCF>TSTTNT94T41G388F</CitCF>
				<CitSmartCardSN>999AW989</CitSmartCardSN>
			</Security>
			<Sla>
				<Log>
					<Global>
						<TrackID>1123685078265</TrackID>
						<Timestamp>10/08/2005+16:44:40,828</Timestamp>
					</Global>
				</Log>
			</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2007-05/appcontext/">
			<Request clientProd="DCSanita"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:CIS.ricercaClinicaGenerica xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/CIS/2007-05/ricercaClinicaGenerica/" dataSetVersion="1.0">
			<param>
				<ricercaClinicaGenerica>
					<datiCittadino>
						<idAssistito>999AW989</idAssistito>
						<codiceFiscaleCittadino>TSTTNT94T41G388F</codiceFiscaleCittadino>
						<idCittadinoNonSISS></idCittadinoNonSISS>
					</datiCittadino>
					<datiClinici/>
					<maxDataEvento>20060126</maxDataEvento>
					<maxRecords>10</maxRecords>
					<pageNumber>2</pageNumber>
				</ricercaClinicaGenerica>
			</param>
		</m:CIS.ricercaClinicaGenerica>
	</soap-env:Body>
</soap-env:Envelope>















